"""База вопросов."""


QUESTIONS = [
    {
        "text": "В какой очередности транспортные средства проедут перекресток?",
        "options": [
            "А. Красный автомобиль, велосипед, синий автомобиль",
            "Б. Велосипед, красный автомобиль, синий автомобиль.",
            "В. Красный автомобиль, синий автомобиль, велосипед.",
        ],
        "answer_idx": 0,
        "image": "01.png",
    },
    {
        "text": "На перекрестке велосипедист собирается повернуть направо. Укажите, каким участникам дорожного движения он должен уступить дорогу?",
        "options": [
            "А. Только пешеходу, переходящему проезжую часть по нерегулируемому пешеходному переходу.",
            "Б. Только пешеходу, переходящему проезжую часть, на которую поворачивает велосипедист.",
            "В. Всем пешеходам.",
        ],
        "answer_idx": 2,
        "image": "02.png",
    },
    {
        "text": "Выберите ситуации, в которых пешеход не нарушает ПДД РФ",
        "options": [
            "6АБ, 6АГ, 6АЕ",
            "6АГ, 6АД, 6АЕ",
        ],
        "answer_idx": 0,
        "image": "03.png",
    },
    {
        "text": "Выберите ситуации, в которых пешеход не нарушает ПДД РФ",
        "options": [
            "6ББ, 6БВ, 6БЕ",
            "6БВ, 6БГ, 6БЕ",
        ],
        "answer_idx": 1,
        "image": "04.png",
    },
    {
        "text": "Выберите картинки, на которых показаны «дорожные ловушки» для пешеходов (небезопасное поведение или нарушение ПДД РФ)",
        "options": [
            "7аа, 7аб, 7аг",
            "7аб, 7аг, 7ае",
        ],
        "answer_idx": 0,
        "image": "05.png",
    },
    {
        "text": "Выберите картинки, на которых показаны «дорожные ловушки» для пешеходов (небезопасное поведение или нарушение ПДД РФ)",
        "options": [
            "7ба, 7бб, 7бв",
            "7ба, 7бв",
        ],
        "answer_idx": 0,
        "image": "06.png",
    },
    {
        "text": "Выберите картинки, на которых участники движения нарушают ПДД РФ",
        "options": [
            "8АА, 8АБ, 8АГ",
            "8АА, 8АБ, 8АВ",
        ],
        "answer_idx": 1,
        "image": "07.png",
    },
    {
        "text": "Выберите картинки, на которых участники движения нарушают ПДД РФ",
        "options": [
            "8БА, 8ББ, 8БВ",
            "8БА, 8ББ, 8БГ",
        ],
        "answer_idx": 0,
        "image": "08.png",
    },
    {
        "text": "Какая из картинок показывает пешехода, который будет больше всего заметен в темное время суток водителями транспортных средств?",
        "options": [
            "9бб",
            "9ба",
        ],
        "answer_idx": 0,
        "image": "09.png",
    },
    {
        "text": "Укажите картинки, на которых пассажиры нарушают ПДД РФ",
        "options": [
            "10АА, 10АВ, 10АЕ",
            "10АА, 10АБ, 10АВ",
        ],
        "answer_idx": 1,
        "image": "10.png",
    },
    {
        "text": "Укажите картинки, на которых есть нарушения правил перевозки людей, или пассажир нарушает ПДД РФ",
        "options": [
            "11АА, 11АБ, 11АВ",
            "11АВ, 11АД",
        ],
        "answer_idx": 0,
        "image": "11.png",
    },
    {
        "text": "Выберите картинки, на которых велосипедист не нарушает ПДД РФ",
        "options": [
            "12аа, 12аб, 12ав",
            "12аа, 12аг",
        ],
        "answer_idx": 0,
        "image": "12.png",
    },
    {
        "text": "Выберите картинки, на которых велосипедист нарушает ПДД РФ",
        "options": [
            "13ба, 13бв",
            "13бв, 13бг, 12бд",
        ],
        "answer_idx": 1,
        "image": "13.png",
    },
    {
        "text": "Укажите, кто из велосипедистов выбрал правильные цвета для световых приборов и катафотов велосипеда?",
        "options": [
            "14ба, 14бб, 14бе",
            "14ба, 14бв, 14бд",
        ],
        "answer_idx": 1,
        "image": "14.png",
    },
    {
        "text": "Велосипедисту нужно приобрести себе стандартную защитную экипировку. Что ему следует выбрать?",
        "options": [
            "15ба, 15бб, 15бв",
            "15ба, 15бб",
        ],
        "answer_idx": 0,
        "image": "15.png",
    },
    {
        "text": "Выберите картинки, на которых велосипедист нарушает ПДД РФ",
        "options": [
            "16аа, 16аг",
            "16аа, 16ав, 16ад",
        ],
        "answer_idx": 1,
        "image": "16.png",
    },
    {
        "text": "Выберите положение, в котором велосипедист оказывается в «слепой зоне» водителя транспортного средства",
        "options": [
            "17аа, 17аб, 17ад",
            "17аб, 17аг, 17ад",
        ],
        "answer_idx": 0,
        "image": "17.png",
    },
    {
        "text": "Выберите дорожный знак, который указывает, что на данной дороге запрещено движение велосипедистов",
        "options": [
            "18 ба",
            "18 бб",
        ],
        "answer_idx": 0,
        "image": "18.png",
    },
    {
        "text": "Каким дорожным знаком обозначается конец велодорожки?",
        "options": [
            "19ба",
            "19бб",
        ],
        "answer_idx": 0,
        "image": "19.png",
    },
]